package com.yw.testrecyclerview.retrofitutils.model.response;

import java.util.List;

/**
 * Created by jiahe008_lvlanlan on 2017/2/24.
 */
public class LineDetailResponse {

    /**
     * head : {"res_code":"0000","res_msg":"success","res_arg":"获取成功"}
     * body : {"finaldestid":"1","id":"589","title":"一品大咖派昆明大理丽江三飞6天","litpic":"http://www.cwly1118.com/uploads/2016/1229/f62322e832979100c3fcb7199cecd0d2.jpg","price":"3799","beizu":"<p>01、单人房间：参团时如遇单人或3人时，补缴房差或以酒店实际情况加床，一般为钢丝床或床垫；不提供自然单间，入住酒店时如需要客人付钥匙牌的押金，若房间内物品没有损坏，退房时退还客人，请配合导游的工作。<\/p><p>02、儿童：12岁及以下包括12周岁儿童，只含半餐和车位，不含景点门票，不占床，不含酒店早餐，产生费用请自理；<\/p><p>03、费用不含：单房差、航空意外险，及一切个人消费（如：酒店内洗衣、电话、行李物品保管费，托运行李超重费、酒店押金、单间差或加床费、自由活动期间的餐食费和交通费、交通延误、取消、意外事件或战争、罢工、自然灾害等不可抗拒因素导致的额外费用、因旅游者违约、自身过错、自身疾病导致的人身财产损失、自费选择项目、以及旅游费用合同内容以外的所有费用）<\/p><p>04、成人持有效期内第二代居民身份证，16周岁以下儿童持户口本正本登机；<\/p><p>05、持老年证、军官证等优惠证件的门票费用一概不退；<\/p><p>06、云南大多景区、景点内均设有购物场所，此乃景区行为。客人若有需要在这些地方购买商品，与我社无关；<\/p><p>07、个人消费说明：非旅行社行程中安排的购物、娱乐等项目属旅游者个人消费行为，如产生纠纷或损失，旅行社不承担责任，且客人需理性购物，购物时注意商品质量及价格，并向商家索取正式发票。<\/p><p>08、参团客人机票一经出票后我社无法办理变更换人、转签、退票请客人注意，如遇客人提出以上情形我社配合客人根据航空公司实际退改签政策为准与航空公司落实并实施。<\/p><p>09、特价机票不得退改签，如遇客人在我社出票后退团，以我社退票政策为准，已确认出票客人如遇调价概不更改，以确认价格为准。<\/p><p>10、航班问题提醒：旅行社对航班因运力、天气等因素延误、变更、取消等无法掌控。如遇此种情况，旅行社将配合客人对行程做出相应的调整，但发生损失与旅行社无关，届时敬请旅游者配合谅解；<\/p><p>11、失信人无法坐飞机、火车，如客人为失信人请提前告知，如知情不报产生损失和无法能团由客人自行承担！<\/p><p>12、以上行程仅供参考，我社根据所订航班，会对行程顺序进行前后调整，但不减少景点、接待标准不变；<\/p><p>13、行程中标注的时间供您参考，因人力不可抗拒因素（自然灾害、堵车、排队等交通状况、政府行为等）影响行程，我社可以做出行程调整，尽力确保行程的顺利进行，实在导致无法按照约定的计划执行的，因变更而超出的费用由旅游者承担； <\/p><p>14、行程中批注的航班、酒店、用餐等要素仅供参考，我社持有根据实际状况变更改行程的权利；请以出团通知及当地实际游览行程安排为准，敬请谅解；<\/p><p>15、行程中的车程时间不包含景点的游览时间，当日景点游览顺序在不影响游程的情况下，我社可调整游览顺序。行程中标注的景点游览时间是根据旅游正常情况来约定的，原则上淡季人不多的时候前面标注的游览时间都能够确保游客充分将景点游览完毕。&nbsp; <\/p><p>16、关于行程上约定的城市之间景点之间的车程时间以无特殊情况（如堵车、下雨、下雪、修路或意外等）特殊状况出现为标准来测算的时间，如有任何一种情况发生都有可能造成时间的变化，请各位游客理解。<\/p><p>17、关于赠送游览项目的声明：若有含门票的赠送景点均属于我社承包销售，故无优惠、免票；凡自愿放弃的或因航班时间、天气、交通情况等人力不可抗拒因素导致的不能赠送的，我社不退任何费用，还请理解;<\/p><p>18、如遇客人退团不能出行，组团社应在客人出团日前3天以传真形式通知我社，不产生任何地接接待费损失（机票损失根据航空公司退票政策为准）；如超过以上日期通知我社之情况，我社均以实际所产生地接损失核算，并请客人在我社收到《组团社客人退团确认件》后7日内补给我社。<\/p><p>19、云南酒店空调定时开放（不是24小时），具体情况根据当地的气候而定，烦请特别注意。<\/p><p>20、因客人报名均为特价团，特价机票不得退改签，客人要如期出团，团进团出，出团前及走团中，因客人自身原因脱团退团，所有费用不退，且需要客人补齐脱团，退团损失，及机票损失，地接损失，费用客人承担！<\/p><p>21、请客人认真填写意见反馈单，我社处理投诉已客人当地签署的旅游意见单为准，请如实填写，如在当地有什么意见请及时反馈与我们，以便我们能尽快解决并满足你的需求。望理解配合！<\/p><p>22、丽江，中甸海拔较高，注意休息，以防出现高山反应；有心脏病，高血压等病的人群慎行，请注意准备一些个人常用药品，以备不时之需。<\/p><p>23、云南地处云贵高原，每天昼夜温差较大（12\u201415摄氏度），请出团前了解当地天气情况，注意着装注意当地天气预报，请带足保暖防寒衣物，云南日照强，紫外线强。长时间在户外活动，请戴上太阳帽，太阳镜，涂抹防晒霜，以保护皮肤，天气变化多端，请携带雨具。<\/p><p>24、云南山高坡大，对限速有严格规定，行程地海拔较高，空气含氧量低，故上坡时旅游车速有时仅20\u201430码，还望谅解。<\/p><p>25、云南属少数民族地区，请尊重当地少数民族的宗教及生活习俗。<\/p><p>26、云南地区经济发展落后，同星级宾馆酒店规模设施落后江浙地区，一些新建的且设施较好的酒店一般位于市区周边，离市区的车程在15-20分左右（特殊原因除外），因云南气候的特殊性，冬季酒店空调定时开放或不开<\/p><p><br/><\/p>","feeinclude":"","features":"","transport":"","xlxq":"撒尼风味餐 楚雄长街宴 大理南诏 丽江风味特色餐 三文鱼盛宴 23-60岁 全程不更好导游 住宿7星高标索菲特铂尔曼度假酒店▲\u201c大咖派\u201d全阳光、透明的服务承诺1、【住宿安排承诺】入住酒店均为精选指定酒店，绝不以次充好，临时更换酒店；全程奢华酒店安排，七星酒店+五星礼遇，让您身份倍增！2、【餐饮安排承诺】所用餐厅为挑选指定餐厅，保证餐厅安全卫生，所提供菜品材料安全，卫生，新鲜。绝不更改用餐地点、降低用餐标准；3、【景点游览承诺】景点游览时间做严格规定，保证充裕的游览时间，绝不压缩或减少景点游览时间；4、【自费安排承诺】严格按照旅游行程安排旅游活动，绝不增加行程外自费项目、绝不更换景点；5、【用车要求承诺】使用在交通部门注册登记的合法正规营运旅游车。座位最大保额在120万。接团前检查，确保车辆安全，整洁，绝不使用无证车辆；6、【导游服务承诺】导游持有效上岗资格证上岗，服务态度真诚、热情，严格执行旅游合同，承诺不索要小费，不强行推荐自费；7、【司机服务承诺】经过滇峰服务体系专业培训，考核上岗。经验丰富，路况熟悉，仪表整洁，性格稳重。绝不在车辆行驶途中出现影响行车安全的不良驾驶习惯；8、【购物安排承诺】安排旅游定点购物商店，货品正宗，质量保证，符合国家旅游法要求。严格按照约定购物时间，绝不故意拖延购物时间；9、【退换货服务承诺】游客在旅游定点购物商店所购商品，均可享受三包服务。如需退换货，我社全力协助，绝不故意推脱；10、【安全问题承诺】我们为每一位游客购买云南旅游组合保险，多重安全保障，让您出行无忧。\u200b","fybubh":"","supplierlist":"58","biaozhun":"1、用房：全程指定高端、豪华酒店，宽敞舒适的空间，贴心的客房服务，让您在舒逸的环境中安枕无忧，蓄精养神以迎接第二天精彩的行程。A、昆明首住：昆明索菲特大酒店、昆明温德姆豪庭大酒店或同级B、昆明尾住：昆明南亚豪生国际大酒店、昆明佳华大酒店或同级C、楚雄：滇菌王大酒店、云华花园大酒店或同级D、丽江：铂尔曼度假酒店（备选：君悦酒店）或者同级2、用餐：地道特色美食：石林撒尼风味餐、楚雄长街宴、大理南诏宴、丽江特色风味餐、丽江三文鱼盛宴。全程5早7正包含4特色餐，中餐餐标400元/桌，晚餐500元/桌，每10人一桌，如遇单团内部分游客不超过5人、不足一桌的，我们会为您作的适当调整，请您谅解。游客因自身原因不跟团用餐或自行用餐的，餐费不退。3、交通：全程空调旅游车，1人1正座；（注：因此团为全国散拼团，全国到达航班较多，昆明段的接送，为我社单独安排车接送，无导游）4、导游：云南优秀导游服务5、门票：行程所列景点第一大门票6、 进店：【帕沙购物综合体】（翡翠+银器），丽江黄龙玉，花市， 8、儿童：12岁及以下儿童只含半正餐和车位，不含门票，不含床，不含火车票、不含机票，不含酒店早餐。如因以上原因产生费用请自理。如儿童不占床的则需按照实际产生费用自理早餐费。报价不含：1、单房差：参团时如遇单人或3人时，补缴房差或以酒店实际情况加床，一般为钢丝床或床垫；不提供自然单间，入住酒店时如需要客人付钥匙牌的押金，若房间内物品没有损坏，退房时退还客人，请配合导游的工作。2、个人消费：酒店电话费、洗衣费、购物等个人消费；人力不可抗拒因素所引起的额外费用,航空保险、旅游意外险。3、自费参考项目： 石林电瓶车25元/人&nbsp;、大理古城电瓶车35元/人、大理古城维护费30元/人&nbsp;&nbsp;、蓝月谷电瓶车60元/人&nbsp;、玉龙雪山氧气瓶100元/人、羽绒服50元/人、野象谷单程索道50元/人、往返70元/人、原始森林公园电瓶车40元/人、澜沧江篝火晚会甲票260/人起、贵宾票380/人起、勐巴拉娜西甲票260/人起、贵宾票380/人起","piclist":["http://www.cwly1118.com/uploads/2016/1229/f62322e832979100c3fcb7199cecd0d2.jpg","http://www.cwly1118.com/uploads/2016/1229/0d8c153b81a6a2dab6b8404368dc82c5.jpg","http://www.cwly1118.com/uploads/2016/1229/81cbfa3e4058ec9008b22ae835ff3111.jpg","http://www.cwly1118.com/uploads/2016/1229/cc3daf47e4dc7a66e3ae077ec1dc2403.jpg","http://www.cwly1118.com/uploads/2016/1229/3e49ef4ea96716c469e561ccaf93c752.jpg","http://www.cwly1118.com/uploads/2016/1229/438defbb6d66233aeb32f3380fe6b305.jpg"],"needjifen":"","xcms":[{"day":"1","title":"北京飞昆明","jieshao":"<p>各地→昆明<\/p><p>您乘机抵达后，我们将在昆明长水机场A出口左侧，1号门旁边的4号柜台\u201c一品云南.大咖派\u201d接站牌处迎接您(接机联系电话：18064841817、15808758157)，并带您乘坐专车前往酒店，办理入住手续。<\/p><p><br/><\/p>"},{"day":"2","title":"昆明 石林楚雄","jieshao":"<p>昆明→石林→楚雄<\/p><p>早餐后，乘车（车程约2小时）【石林世界地质公园】（游览时间约120分钟左右，自理电瓶车25元/人）国家5A级风景区，是世界最典型的喀斯特地貌景观，素有\u201c造型地貌天然博物馆\u201d之称；中餐后石林撒尼风味餐，后乘车返回昆明，稍作休息后前往楚雄（距离约160公里，车行约120分钟）。在楚雄，您能够体验到同样有地方特色的风味餐：长街宴，彝族特色传统菜肴，之后心满意足地入住酒店休息。<\/p><p>中餐：石林撤尼人家<\/p><p>餐单：铁板烧汁鱼、鼓油炝香鸡、水煮肉片（中辣）、牛汤锅、阿诗玛小炒肉、彝家腊肉、双拼（竹虫。芝麻肉）、野菜蛋饼、青椒肉片、酱爆茄子、鸡汁娃娃菜、撒伲大饼、咸菜、青菜汤、米饭<\/p><p>晚餐：彝人古镇长街宴<\/p><p>\u200b<br/><\/p>"},{"day":"3","title":"楚雄→大理古城→180度环游洱海→大理→丽江","jieshao":"<p>早餐后，前往\u201c五朵金花\u201d的故乡\u2014大理（距离约160公里，车行约150分钟）探寻风花雪月的影子。游览文献名邦\u2014【大理古城、洋人街】（约60分钟，自理古维30元/人、自理电瓶车35元/人），让您置身街巷老宅，追寻昔日\u201c叶榆\u201d风貌。之后乘车游览【180度环游洱海】（游览约100分钟）来到洱海，会发现时光在这里变得清透。苍山十九峰的壮美在洱海的万顷碧波里投了影子，一番盛景曾引得无数诗人尽折腰。您将享受180度环游水色连天的洱海的礼遇，体验洱海最美的景观。中餐用特色餐南诏宴，之后乘车前往丽江（距离约120公里，车行约90分钟），晚餐享用（丽江风味特色餐），后观赏中国演艺唯一上市公司，宋城集团倾力打造的纳西放族民族发展史诗级、一生必看的演出【丽江千古情】（约60分钟），之后导游组织酒吧活动，感受束河古镇轻音乐的闲适与美妙。晚入住酒店休息。<\/p><p>中餐：大理南诏宴<\/p><p>餐单：香糟洱海鱼、白族梅菜扣肉、白族凉鸡  、口水肉片、白族炖白豆、红烧肉  、双椒肉丝、葱花鸡蛋糕、手撕包菜 、香葱土豆片、炝黄瓜、紫菜蛋花汤 、榨菜、白米饭<\/p><p>晚餐：丽江三文鱼火锅<\/p><p>餐单：三文鱼3.5斤、鱼骨头锅底、生鱼片4份、椒盐鱼片、小炒肉、咸鸭蛋拼花生、凉拌蕨根粉、小瓜焖土豆、脆皮肠、毛肚、虾丸、羊肉卷、羊血、小青菜、小白菜、土豆、木尔、粉条、丽江粑粑、米饭<\/p><p>\u200b<br/><\/p><p><br/><\/p>"},{"day":"4","title":"丽江翡翠玉石交易中心→玉龙雪山→入住丽江","jieshao":"<p>早餐后，前往【帕沙购物综合体】（翡翠+银器）（约180分钟）琳琅满目的珠宝珍品将让您目不暇接。中餐后乘车前往【丽江玉龙雪山】（整个景区游览时间约200分钟，不含排队时间）。从草木掩映，野生牡丹、雪莲等穿插点缀的高原牧场【甘海子】出发，搭乘我国海拔最高、运力最强的旅游客运索道【冰川大索道】（含索道及环保车202元），我国海拔最高、运力最强的旅游客运索道，索道可抵达海拔4506米。【白水河】由于灰白色石灰石沉积在河道底部，因此远远看上去像极了白色的河流\u2014\u2014您届时一定也这么认为。若有纳西人牵着骡马从旁而过，会有一种原生态的美感，那是在都市里绝对看不到的。接着游览【蓝月谷】（自理电瓶车60元/人），这里的山谷呈月牙形，晴天时湖水是天蓝色，远看就像一轮蓝色的月亮镶嵌在玉龙雪山脚下；晚餐享用（丽江三文鱼盛宴）下榻丽江后，您可以自行游览【丽江古城】，又名\u201c大研古镇\u201d（含古城维护费），是一座风景秀丽，历史悠久和文化灿烂的名城，也是中国罕见的保存相当完好的少数民族古镇。（因丽江古城为开放式古城，基本为自行游览，时间是根据客人自订）。之后入住酒店休息<\/p><p>中餐：马帮菜<\/p><p>菜单：纳西火锅、马帮扣肉、东巴双拼、银丝莲白、豆豉蒸鱼、番茄炒蛋、云南汽锅鸡、云腿北风菌、纳西鸡豆粉、农家小炒肉、青椒炒肉、米饭、榨菜<\/p><p>晚餐：玛卡鸡火锅<\/p><p>餐单：鸡3斤、8素，2荤汤菜、泡萝卜，花生米，、烤鸭、麻婆豆腐、宫爆鸡丁<\/p><p>、鸡豆凉粉、干椒时蔬、水焖粑粑、米饭、火锅调料<\/p><p><br/><\/p>"},{"day":"5","title":"丽江黄龙玉展→拉市海骑马划船→丽江飞昆明→入住昆明","jieshao":"<p>丽江黄龙玉展→拉市海骑马划船→丽江飞昆明→入住昆明<\/p><p>早餐后，前往观赏【丽江黄龙玉】（约90分钟）。黄龙玉因为有着田黄般的颜色、翡翠的硬度，晶莹剔透的质地加上精细的雕工，有着极高的观赏价值，为众多玉石爱好者所收藏， 您可在此细细观赏。中餐后，下午前往【拉市海】珍稀鸟类的天堂，云南省第一个以\u201c湿地\u201d命名的自然保护区\u2014拉市海（约90分钟，或根据您的选择灵活安排游玩时间），您可以选择更深入丽江山水美景及人文风情，晚上我们乘坐飞机飞昆明，入住昆明。<\/p><p>中餐：赵雄阁农家餐<\/p><p>菜单：木耳炖土鸡、风吹半腌肉、绿豆顿粉肠、小南瓜杂锅菜、酸辣鲫鱼、毛血旺、白参蒸蛋、蒸蛋卷、鸡豆凉粉、炒野生菌、炒金白菜、青菜汤<\/p><p>晚餐：无<\/p><p>\u200b<br/><\/p>"},{"day":"6","title":"昆明→鲜花市场→各地","jieshao":"<p>昆明→鲜花市场→各地<\/p><p>早餐后，【昆明鲜花市场】您可在这儿挑选中意的云南鲜花、干花、植物精油等土特产，作为伴手礼回家馈赠亲友，分享旅程的喜悦。注12点以前航班无法游花市<\/p><p><br/><\/p>"}],"comment":"","typeid":1,"plcount":"0","group":"","im":"","sjmc":"山海边-云南青之旅三部","tel":"400-900-5665 转 218","type":"1","iscollect":0}
     */


    /**
     * finaldestid : 1
     * id : 589
     * title : 一品大咖派昆明大理丽江三飞6天
     * litpic : http://www.cwly1118.com/uploads/2016/1229/f62322e832979100c3fcb7199cecd0d2.jpg
     * price : 3799
     * beizu : <p>01、单人房间：参团时如遇单人或3人时，补缴房差或以酒店实际情况加床，一般为钢丝床或床垫；不提供自然单间，入住酒店时如需要客人付钥匙牌的押金，若房间内物品没有损坏，退房时退还客人，请配合导游的工作。</p><p>02、儿童：12岁及以下包括12周岁儿童，只含半餐和车位，不含景点门票，不占床，不含酒店早餐，产生费用请自理；</p><p>03、费用不含：单房差、航空意外险，及一切个人消费（如：酒店内洗衣、电话、行李物品保管费，托运行李超重费、酒店押金、单间差或加床费、自由活动期间的餐食费和交通费、交通延误、取消、意外事件或战争、罢工、自然灾害等不可抗拒因素导致的额外费用、因旅游者违约、自身过错、自身疾病导致的人身财产损失、自费选择项目、以及旅游费用合同内容以外的所有费用）</p><p>04、成人持有效期内第二代居民身份证，16周岁以下儿童持户口本正本登机；</p><p>05、持老年证、军官证等优惠证件的门票费用一概不退；</p><p>06、云南大多景区、景点内均设有购物场所，此乃景区行为。客人若有需要在这些地方购买商品，与我社无关；</p><p>07、个人消费说明：非旅行社行程中安排的购物、娱乐等项目属旅游者个人消费行为，如产生纠纷或损失，旅行社不承担责任，且客人需理性购物，购物时注意商品质量及价格，并向商家索取正式发票。</p><p>08、参团客人机票一经出票后我社无法办理变更换人、转签、退票请客人注意，如遇客人提出以上情形我社配合客人根据航空公司实际退改签政策为准与航空公司落实并实施。</p><p>09、特价机票不得退改签，如遇客人在我社出票后退团，以我社退票政策为准，已确认出票客人如遇调价概不更改，以确认价格为准。</p><p>10、航班问题提醒：旅行社对航班因运力、天气等因素延误、变更、取消等无法掌控。如遇此种情况，旅行社将配合客人对行程做出相应的调整，但发生损失与旅行社无关，届时敬请旅游者配合谅解；</p><p>11、失信人无法坐飞机、火车，如客人为失信人请提前告知，如知情不报产生损失和无法能团由客人自行承担！</p><p>12、以上行程仅供参考，我社根据所订航班，会对行程顺序进行前后调整，但不减少景点、接待标准不变；</p><p>13、行程中标注的时间供您参考，因人力不可抗拒因素（自然灾害、堵车、排队等交通状况、政府行为等）影响行程，我社可以做出行程调整，尽力确保行程的顺利进行，实在导致无法按照约定的计划执行的，因变更而超出的费用由旅游者承担； </p><p>14、行程中批注的航班、酒店、用餐等要素仅供参考，我社持有根据实际状况变更改行程的权利；请以出团通知及当地实际游览行程安排为准，敬请谅解；</p><p>15、行程中的车程时间不包含景点的游览时间，当日景点游览顺序在不影响游程的情况下，我社可调整游览顺序。行程中标注的景点游览时间是根据旅游正常情况来约定的，原则上淡季人不多的时候前面标注的游览时间都能够确保游客充分将景点游览完毕。&nbsp; </p><p>16、关于行程上约定的城市之间景点之间的车程时间以无特殊情况（如堵车、下雨、下雪、修路或意外等）特殊状况出现为标准来测算的时间，如有任何一种情况发生都有可能造成时间的变化，请各位游客理解。</p><p>17、关于赠送游览项目的声明：若有含门票的赠送景点均属于我社承包销售，故无优惠、免票；凡自愿放弃的或因航班时间、天气、交通情况等人力不可抗拒因素导致的不能赠送的，我社不退任何费用，还请理解;</p><p>18、如遇客人退团不能出行，组团社应在客人出团日前3天以传真形式通知我社，不产生任何地接接待费损失（机票损失根据航空公司退票政策为准）；如超过以上日期通知我社之情况，我社均以实际所产生地接损失核算，并请客人在我社收到《组团社客人退团确认件》后7日内补给我社。</p><p>19、云南酒店空调定时开放（不是24小时），具体情况根据当地的气候而定，烦请特别注意。</p><p>20、因客人报名均为特价团，特价机票不得退改签，客人要如期出团，团进团出，出团前及走团中，因客人自身原因脱团退团，所有费用不退，且需要客人补齐脱团，退团损失，及机票损失，地接损失，费用客人承担！</p><p>21、请客人认真填写意见反馈单，我社处理投诉已客人当地签署的旅游意见单为准，请如实填写，如在当地有什么意见请及时反馈与我们，以便我们能尽快解决并满足你的需求。望理解配合！</p><p>22、丽江，中甸海拔较高，注意休息，以防出现高山反应；有心脏病，高血压等病的人群慎行，请注意准备一些个人常用药品，以备不时之需。</p><p>23、云南地处云贵高原，每天昼夜温差较大（12—15摄氏度），请出团前了解当地天气情况，注意着装注意当地天气预报，请带足保暖防寒衣物，云南日照强，紫外线强。长时间在户外活动，请戴上太阳帽，太阳镜，涂抹防晒霜，以保护皮肤，天气变化多端，请携带雨具。</p><p>24、云南山高坡大，对限速有严格规定，行程地海拔较高，空气含氧量低，故上坡时旅游车速有时仅20—30码，还望谅解。</p><p>25、云南属少数民族地区，请尊重当地少数民族的宗教及生活习俗。</p><p>26、云南地区经济发展落后，同星级宾馆酒店规模设施落后江浙地区，一些新建的且设施较好的酒店一般位于市区周边，离市区的车程在15-20分左右（特殊原因除外），因云南气候的特殊性，冬季酒店空调定时开放或不开</p><p><br/></p>
     * feeinclude :
     * features :
     * transport :
     * xlxq : 撒尼风味餐 楚雄长街宴 大理南诏 丽江风味特色餐 三文鱼盛宴 23-60岁 全程不更好导游 住宿7星高标索菲特铂尔曼度假酒店▲“大咖派”全阳光、透明的服务承诺1、【住宿安排承诺】入住酒店均为精选指定酒店，绝不以次充好，临时更换酒店；全程奢华酒店安排，七星酒店+五星礼遇，让您身份倍增！2、【餐饮安排承诺】所用餐厅为挑选指定餐厅，保证餐厅安全卫生，所提供菜品材料安全，卫生，新鲜。绝不更改用餐地点、降低用餐标准；3、【景点游览承诺】景点游览时间做严格规定，保证充裕的游览时间，绝不压缩或减少景点游览时间；4、【自费安排承诺】严格按照旅游行程安排旅游活动，绝不增加行程外自费项目、绝不更换景点；5、【用车要求承诺】使用在交通部门注册登记的合法正规营运旅游车。座位最大保额在120万。接团前检查，确保车辆安全，整洁，绝不使用无证车辆；6、【导游服务承诺】导游持有效上岗资格证上岗，服务态度真诚、热情，严格执行旅游合同，承诺不索要小费，不强行推荐自费；7、【司机服务承诺】经过滇峰服务体系专业培训，考核上岗。经验丰富，路况熟悉，仪表整洁，性格稳重。绝不在车辆行驶途中出现影响行车安全的不良驾驶习惯；8、【购物安排承诺】安排旅游定点购物商店，货品正宗，质量保证，符合国家旅游法要求。严格按照约定购物时间，绝不故意拖延购物时间；9、【退换货服务承诺】游客在旅游定点购物商店所购商品，均可享受三包服务。如需退换货，我社全力协助，绝不故意推脱；10、【安全问题承诺】我们为每一位游客购买云南旅游组合保险，多重安全保障，让您出行无忧。​
     * fybubh :
     * supplierlist : 58
     * biaozhun : 1、用房：全程指定高端、豪华酒店，宽敞舒适的空间，贴心的客房服务，让您在舒逸的环境中安枕无忧，蓄精养神以迎接第二天精彩的行程。A、昆明首住：昆明索菲特大酒店、昆明温德姆豪庭大酒店或同级B、昆明尾住：昆明南亚豪生国际大酒店、昆明佳华大酒店或同级C、楚雄：滇菌王大酒店、云华花园大酒店或同级D、丽江：铂尔曼度假酒店（备选：君悦酒店）或者同级2、用餐：地道特色美食：石林撒尼风味餐、楚雄长街宴、大理南诏宴、丽江特色风味餐、丽江三文鱼盛宴。全程5早7正包含4特色餐，中餐餐标400元/桌，晚餐500元/桌，每10人一桌，如遇单团内部分游客不超过5人、不足一桌的，我们会为您作的适当调整，请您谅解。游客因自身原因不跟团用餐或自行用餐的，餐费不退。3、交通：全程空调旅游车，1人1正座；（注：因此团为全国散拼团，全国到达航班较多，昆明段的接送，为我社单独安排车接送，无导游）4、导游：云南优秀导游服务5、门票：行程所列景点第一大门票6、 进店：【帕沙购物综合体】（翡翠+银器），丽江黄龙玉，花市， 8、儿童：12岁及以下儿童只含半正餐和车位，不含门票，不含床，不含火车票、不含机票，不含酒店早餐。如因以上原因产生费用请自理。如儿童不占床的则需按照实际产生费用自理早餐费。报价不含：1、单房差：参团时如遇单人或3人时，补缴房差或以酒店实际情况加床，一般为钢丝床或床垫；不提供自然单间，入住酒店时如需要客人付钥匙牌的押金，若房间内物品没有损坏，退房时退还客人，请配合导游的工作。2、个人消费：酒店电话费、洗衣费、购物等个人消费；人力不可抗拒因素所引起的额外费用,航空保险、旅游意外险。3、自费参考项目： 石林电瓶车25元/人&nbsp;、大理古城电瓶车35元/人、大理古城维护费30元/人&nbsp;&nbsp;、蓝月谷电瓶车60元/人&nbsp;、玉龙雪山氧气瓶100元/人、羽绒服50元/人、野象谷单程索道50元/人、往返70元/人、原始森林公园电瓶车40元/人、澜沧江篝火晚会甲票260/人起、贵宾票380/人起、勐巴拉娜西甲票260/人起、贵宾票380/人起
     * piclist : ["http://www.cwly1118.com/uploads/2016/1229/f62322e832979100c3fcb7199cecd0d2.jpg","http://www.cwly1118.com/uploads/2016/1229/0d8c153b81a6a2dab6b8404368dc82c5.jpg","http://www.cwly1118.com/uploads/2016/1229/81cbfa3e4058ec9008b22ae835ff3111.jpg","http://www.cwly1118.com/uploads/2016/1229/cc3daf47e4dc7a66e3ae077ec1dc2403.jpg","http://www.cwly1118.com/uploads/2016/1229/3e49ef4ea96716c469e561ccaf93c752.jpg","http://www.cwly1118.com/uploads/2016/1229/438defbb6d66233aeb32f3380fe6b305.jpg"]
     * needjifen :
     * xcms : [{"day":"1","title":"北京飞昆明","jieshao":"<p>各地→昆明<\/p><p>您乘机抵达后，我们将在昆明长水机场A出口左侧，1号门旁边的4号柜台\u201c一品云南.大咖派\u201d接站牌处迎接您(接机联系电话：18064841817、15808758157)，并带您乘坐专车前往酒店，办理入住手续。<\/p><p><br/><\/p>"},{"day":"2","title":"昆明 石林楚雄","jieshao":"<p>昆明→石林→楚雄<\/p><p>早餐后，乘车（车程约2小时）【石林世界地质公园】（游览时间约120分钟左右，自理电瓶车25元/人）国家5A级风景区，是世界最典型的喀斯特地貌景观，素有\u201c造型地貌天然博物馆\u201d之称；中餐后石林撒尼风味餐，后乘车返回昆明，稍作休息后前往楚雄（距离约160公里，车行约120分钟）。在楚雄，您能够体验到同样有地方特色的风味餐：长街宴，彝族特色传统菜肴，之后心满意足地入住酒店休息。<\/p><p>中餐：石林撤尼人家<\/p><p>餐单：铁板烧汁鱼、鼓油炝香鸡、水煮肉片（中辣）、牛汤锅、阿诗玛小炒肉、彝家腊肉、双拼（竹虫。芝麻肉）、野菜蛋饼、青椒肉片、酱爆茄子、鸡汁娃娃菜、撒伲大饼、咸菜、青菜汤、米饭<\/p><p>晚餐：彝人古镇长街宴<\/p><p>\u200b<br/><\/p>"},{"day":"3","title":"楚雄→大理古城→180度环游洱海→大理→丽江","jieshao":"<p>早餐后，前往\u201c五朵金花\u201d的故乡\u2014大理（距离约160公里，车行约150分钟）探寻风花雪月的影子。游览文献名邦\u2014【大理古城、洋人街】（约60分钟，自理古维30元/人、自理电瓶车35元/人），让您置身街巷老宅，追寻昔日\u201c叶榆\u201d风貌。之后乘车游览【180度环游洱海】（游览约100分钟）来到洱海，会发现时光在这里变得清透。苍山十九峰的壮美在洱海的万顷碧波里投了影子，一番盛景曾引得无数诗人尽折腰。您将享受180度环游水色连天的洱海的礼遇，体验洱海最美的景观。中餐用特色餐南诏宴，之后乘车前往丽江（距离约120公里，车行约90分钟），晚餐享用（丽江风味特色餐），后观赏中国演艺唯一上市公司，宋城集团倾力打造的纳西放族民族发展史诗级、一生必看的演出【丽江千古情】（约60分钟），之后导游组织酒吧活动，感受束河古镇轻音乐的闲适与美妙。晚入住酒店休息。<\/p><p>中餐：大理南诏宴<\/p><p>餐单：香糟洱海鱼、白族梅菜扣肉、白族凉鸡  、口水肉片、白族炖白豆、红烧肉  、双椒肉丝、葱花鸡蛋糕、手撕包菜 、香葱土豆片、炝黄瓜、紫菜蛋花汤 、榨菜、白米饭<\/p><p>晚餐：丽江三文鱼火锅<\/p><p>餐单：三文鱼3.5斤、鱼骨头锅底、生鱼片4份、椒盐鱼片、小炒肉、咸鸭蛋拼花生、凉拌蕨根粉、小瓜焖土豆、脆皮肠、毛肚、虾丸、羊肉卷、羊血、小青菜、小白菜、土豆、木尔、粉条、丽江粑粑、米饭<\/p><p>\u200b<br/><\/p><p><br/><\/p>"},{"day":"4","title":"丽江翡翠玉石交易中心→玉龙雪山→入住丽江","jieshao":"<p>早餐后，前往【帕沙购物综合体】（翡翠+银器）（约180分钟）琳琅满目的珠宝珍品将让您目不暇接。中餐后乘车前往【丽江玉龙雪山】（整个景区游览时间约200分钟，不含排队时间）。从草木掩映，野生牡丹、雪莲等穿插点缀的高原牧场【甘海子】出发，搭乘我国海拔最高、运力最强的旅游客运索道【冰川大索道】（含索道及环保车202元），我国海拔最高、运力最强的旅游客运索道，索道可抵达海拔4506米。【白水河】由于灰白色石灰石沉积在河道底部，因此远远看上去像极了白色的河流\u2014\u2014您届时一定也这么认为。若有纳西人牵着骡马从旁而过，会有一种原生态的美感，那是在都市里绝对看不到的。接着游览【蓝月谷】（自理电瓶车60元/人），这里的山谷呈月牙形，晴天时湖水是天蓝色，远看就像一轮蓝色的月亮镶嵌在玉龙雪山脚下；晚餐享用（丽江三文鱼盛宴）下榻丽江后，您可以自行游览【丽江古城】，又名\u201c大研古镇\u201d（含古城维护费），是一座风景秀丽，历史悠久和文化灿烂的名城，也是中国罕见的保存相当完好的少数民族古镇。（因丽江古城为开放式古城，基本为自行游览，时间是根据客人自订）。之后入住酒店休息<\/p><p>中餐：马帮菜<\/p><p>菜单：纳西火锅、马帮扣肉、东巴双拼、银丝莲白、豆豉蒸鱼、番茄炒蛋、云南汽锅鸡、云腿北风菌、纳西鸡豆粉、农家小炒肉、青椒炒肉、米饭、榨菜<\/p><p>晚餐：玛卡鸡火锅<\/p><p>餐单：鸡3斤、8素，2荤汤菜、泡萝卜，花生米，、烤鸭、麻婆豆腐、宫爆鸡丁<\/p><p>、鸡豆凉粉、干椒时蔬、水焖粑粑、米饭、火锅调料<\/p><p><br/><\/p>"},{"day":"5","title":"丽江黄龙玉展→拉市海骑马划船→丽江飞昆明→入住昆明","jieshao":"<p>丽江黄龙玉展→拉市海骑马划船→丽江飞昆明→入住昆明<\/p><p>早餐后，前往观赏【丽江黄龙玉】（约90分钟）。黄龙玉因为有着田黄般的颜色、翡翠的硬度，晶莹剔透的质地加上精细的雕工，有着极高的观赏价值，为众多玉石爱好者所收藏， 您可在此细细观赏。中餐后，下午前往【拉市海】珍稀鸟类的天堂，云南省第一个以\u201c湿地\u201d命名的自然保护区\u2014拉市海（约90分钟，或根据您的选择灵活安排游玩时间），您可以选择更深入丽江山水美景及人文风情，晚上我们乘坐飞机飞昆明，入住昆明。<\/p><p>中餐：赵雄阁农家餐<\/p><p>菜单：木耳炖土鸡、风吹半腌肉、绿豆顿粉肠、小南瓜杂锅菜、酸辣鲫鱼、毛血旺、白参蒸蛋、蒸蛋卷、鸡豆凉粉、炒野生菌、炒金白菜、青菜汤<\/p><p>晚餐：无<\/p><p>\u200b<br/><\/p>"},{"day":"6","title":"昆明→鲜花市场→各地","jieshao":"<p>昆明→鲜花市场→各地<\/p><p>早餐后，【昆明鲜花市场】您可在这儿挑选中意的云南鲜花、干花、植物精油等土特产，作为伴手礼回家馈赠亲友，分享旅程的喜悦。注12点以前航班无法游花市<\/p><p><br/><\/p>"}]
     * comment :
     * typeid : 1
     * plcount : 0
     * group :
     * im :
     * sjmc : 山海边-云南青之旅三部
     * tel : 400-900-5665 转 218
     * type : 1
     * iscollect : 0
     */

    private String finaldestid;
    private String id;
    private String title;
    private String litpic;
    private String price;
    private String beizu;
    private String feeinclude;
    private String features;
    private String transport;
    private String xlxq;
    private String fybubh;
    private String supplierlist;
    private String biaozhun;
    private String needjifen;
    private String comment;
    private int typeid;
    private String plcount;
    private String group;
    private String im;
    private String sjmc;
    private String tel;
    private String type;
    private int iscollect;
    private List<String> piclist;
    private List<XcmsBean> xcms;

    public String getFinaldestid() {
        return finaldestid;
    }

    public void setFinaldestid(String finaldestid) {
        this.finaldestid = finaldestid;
    }

    public String getId() {
        return id;
    }

    public void setId(String id) {
        this.id = id;
    }

    public String getTitle() {
        return title;
    }

    public void setTitle(String title) {
        this.title = title;
    }

    public String getLitpic() {
        return litpic;
    }

    public void setLitpic(String litpic) {
        this.litpic = litpic;
    }

    public String getPrice() {
        return price;
    }

    public void setPrice(String price) {
        this.price = price;
    }

    public String getBeizu() {
        return beizu;
    }

    public void setBeizu(String beizu) {
        this.beizu = beizu;
    }

    public String getFeeinclude() {
        return feeinclude;
    }

    public void setFeeinclude(String feeinclude) {
        this.feeinclude = feeinclude;
    }

    public String getFeatures() {
        return features;
    }

    public void setFeatures(String features) {
        this.features = features;
    }

    public String getTransport() {
        return transport;
    }

    public void setTransport(String transport) {
        this.transport = transport;
    }

    public String getXlxq() {
        return xlxq;
    }

    public void setXlxq(String xlxq) {
        this.xlxq = xlxq;
    }

    public String getFybubh() {
        return fybubh;
    }

    public void setFybubh(String fybubh) {
        this.fybubh = fybubh;
    }

    public String getSupplierlist() {
        return supplierlist;
    }

    public void setSupplierlist(String supplierlist) {
        this.supplierlist = supplierlist;
    }

    public String getBiaozhun() {
        return biaozhun;
    }

    public void setBiaozhun(String biaozhun) {
        this.biaozhun = biaozhun;
    }

    public String getNeedjifen() {
        return needjifen;
    }

    public void setNeedjifen(String needjifen) {
        this.needjifen = needjifen;
    }

    public String getComment() {
        return comment;
    }

    public void setComment(String comment) {
        this.comment = comment;
    }

    public int getTypeid() {
        return typeid;
    }

    public void setTypeid(int typeid) {
        this.typeid = typeid;
    }

    public String getPlcount() {
        return plcount;
    }

    public void setPlcount(String plcount) {
        this.plcount = plcount;
    }

    public String getGroup() {
        return group;
    }

    public void setGroup(String group) {
        this.group = group;
    }

    public String getIm() {
        return im;
    }

    public void setIm(String im) {
        this.im = im;
    }

    public String getSjmc() {
        return sjmc;
    }

    public void setSjmc(String sjmc) {
        this.sjmc = sjmc;
    }

    public String getTel() {
        return tel;
    }

    public void setTel(String tel) {
        this.tel = tel;
    }

    public String getType() {
        return type;
    }

    public void setType(String type) {
        this.type = type;
    }

    public int getIscollect() {
        return iscollect;
    }

    public void setIscollect(int iscollect) {
        this.iscollect = iscollect;
    }

    public List<String> getPiclist() {
        return piclist;
    }

    public void setPiclist(List<String> piclist) {
        this.piclist = piclist;
    }

    public List<XcmsBean> getXcms() {
        return xcms;
    }

    public void setXcms(List<XcmsBean> xcms) {
        this.xcms = xcms;
    }

    public static class XcmsBean {
        /**
         * day : 1
         * title : 北京飞昆明
         * jieshao : <p>各地→昆明</p><p>您乘机抵达后，我们将在昆明长水机场A出口左侧，1号门旁边的4号柜台“一品云南.大咖派”接站牌处迎接您(接机联系电话：18064841817、15808758157)，并带您乘坐专车前往酒店，办理入住手续。</p><p><br/></p>
         */

        private String day;
        private String title;
        private String jieshao;

        public String getDay() {
            return day;
        }

        public void setDay(String day) {
            this.day = day;
        }

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getJieshao() {
            return jieshao;
        }

        public void setJieshao(String jieshao) {
            this.jieshao = jieshao;
        }
    }
}
